{
  "redditRules": {
    "rule1": {
      "rule_title": "1. Keep sbumissions on topic and of high quality",
      "rule_content": "Submissions should be directly related to programming. Just because it has a computer in it doesn't make it programming.\r\n\r\nSubmissions containing no real content that are simply farming for e-mail addresses will be removed as spam.\r\n\r\nDirect links to app demos (unrelated to programming) will be removed. Please link to a blog post/post-mortem about the development process instead."
    },
    "rule2": {
      "rule_title": "2. No surveys",
      "rule_content": "Surveys/polls are typically obnoxious. Pretty much any survey, academic or otherwise, will be removed by the mod team. Check out /r/samplesize as an alternative place to submit surveys.\r\n\r\nExceptions are made for high quality surveys hosted by established members of the software development community (really just the annual SO Developer Survey)."
    },
    "rule3": {
      "rule_title": "3. No résumés/job listings",
      "rule_content": "/r/programming is not a jobs board. Please visit /r/forhire or /r/jobbit for submitting résumés or open positions.\r\n\r\nSubmissions on the topic of hiring programmers or getting hired as a programmer are generally acceptable, as long as they are not a résumés or an ad for an open position in disguise."
    },
    "rule4": {
      "rule_title": "4. /r/programming is not a support forum",
      "rule_content": "/r/programming is not a support forum. If you have a question, check out /r/learnprogramming, /r/cscareerquestions, or Stack Overflow."
    },
    "rule5": {
      "rule_title": "5. Spam",
      "rule_content": "Reddit may have relaxed its position on self-promotion, but /r/programming has not:\r\n\r\n•If a majority of your contributions to reddit constitute self-promotion, you will be banned\r\n•If you immediately start submitting promotional material with a fresh account, you will be banned\r\n•The mods of /r/programming all have day jobs, we do not waste time handing out warnings\r\nIf you wish to use reddit as a promotional tool, please do so legitimately."
    }
  }
}
